## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_linux_virtual_machine.my_terraform_vm has been deleted
  - resource "azurerm_linux_virtual_machine" "my_terraform_vm" {
        id                              = "/subscriptions/b840382c-ee0b-4177-bc4a-293e87169f7a/resourceGroups/rg_vm_linux/providers/Microsoft.Compute/virtualMachines/myVM"
        name                            = "myVM"
      - public_ip_address               = "52.138.194.104" -> null
        tags                            = {}
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_network_interface.my_terraform_nic has been deleted
  - resource "azurerm_network_interface" "my_terraform_nic" {
      - id                            = "/subscriptions/b840382c-ee0b-4177-bc4a-293e87169f7a/resourceGroups/rg_vm_linux/providers/Microsoft.Network/networkInterfaces/myNIC" -> null
        name                          = "myNIC"
        tags                          = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_security_group.my_terraform_nsg has been deleted
  - resource "azurerm_network_security_group" "my_terraform_nsg" {
      - id                  = "/subscriptions/b840382c-ee0b-4177-bc4a-293e87169f7a/resourceGroups/rg_vm_linux/providers/Microsoft.Network/networkSecurityGroups/upNetworkSecurityGroup" -> null
        name                = "upNetworkSecurityGroup"
        tags                = {}
        # (3 unchanged attributes hidden)
    }

  # azurerm_public_ip.my_terraform_public_ip has been deleted
  - resource "azurerm_public_ip" "my_terraform_public_ip" {
      - fqdn                    = "bhs-task-web.northeurope.cloudapp.azure.com" -> null
      - id                      = "/subscriptions/b840382c-ee0b-4177-bc4a-293e87169f7a/resourceGroups/rg_vm_linux/providers/Microsoft.Network/publicIPAddresses/myPublicIP" -> null
        name                    = "myPublicIP"
        tags                    = {}
        # (12 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg has been deleted
  - resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/b840382c-ee0b-4177-bc4a-293e87169f7a/resourceGroups/rg_vm_linux"
      - location = "northeurope" -> null
      - name     = "rg_vm_linux" -> null
        tags     = {}
    }

  # azurerm_storage_account.my_storage_account has been deleted
  - resource "azurerm_storage_account" "my_storage_account" {
        id                                = "/subscriptions/b840382c-ee0b-4177-bc4a-293e87169f7a/resourceGroups/rg_vm_linux/providers/Microsoft.Storage/storageAccounts/diag316926a224d09c1d"
        name                              = "diag316926a224d09c1d"
      - primary_blob_endpoint             = "https://diag316926a224d09c1d.blob.core.windows.net/" -> null
        tags                              = {}
        # (32 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_subnet.my_terraform_subnet has been deleted
  - resource "azurerm_subnet" "my_terraform_subnet" {
      - id                                             = "/subscriptions/b840382c-ee0b-4177-bc4a-293e87169f7a/resourceGroups/rg_vm_linux/providers/Microsoft.Network/virtualNetworks/myVnet/subnets/mySubnet" -> null
        name                                           = "mySubnet"
        # (8 unchanged attributes hidden)
    }

  # azurerm_virtual_network.my_terraform_network has been deleted
  - resource "azurerm_virtual_network" "my_terraform_network" {
        id                      = "/subscriptions/b840382c-ee0b-4177-bc4a-293e87169f7a/resourceGroups/rg_vm_linux/providers/Microsoft.Network/virtualNetworks/myVnet"
      - name                    = "myVnet" -> null
        tags                    = {}
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.my_terraform_vm will be created
  + resource "azurerm_linux_virtual_machine" "my_terraform_vm" {
      + admin_username                  = "azureadmin"
      + allow_extension_operations      = true
      + computer_name                   = "hostname"
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "northeurope"
      + max_bid_price                   = -1
      + name                            = "myVM"
      + network_interface_ids           = (known after apply)
      + patch_mode                      = "ImageDefault"
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "rg_vm_linux"
      + size                            = "Standard_B2als_v2"
      + virtual_machine_id              = (known after apply)
      + zone                            = (known after apply)

      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDZlFzHD9+IB74ALCfU6Jnt5PLRbAuw1OsY1vIyHnaFB83M6siH5eY1OMKVEjTgGM6fC+XgMTCE2SFy4A/98CXdsMHqmT3XehlBT4q4yUzxR2L1+pU1fVTi8f5Q6gYo4IqVTsLXhOElngOSto50tNgDSgkv0ouX2elBQjD/eKrf+AwGlEY09rJ2ZBojsUfQurQWIVLObvJJRWeBL2+tNzJLwZmhj6EvF42DfVuZfuQVzJvp+sXTLBnMKfo8Swhq8CGhWEzzr4Yin8M9zXBGLo6tBJjsXh1OEBb1UoNEWZoR6ifQIm2lZK0OXFYEV5iIwmcNK2kq8TisoLwV/j77MTmw+eZjeBQzz//GQCdtqkbovbuxmRS78Ow27mvYxU6/PEyviP794pmHzV9qYJoR0DiQOGPV37tKPI1Y2uxcXp6EC1mnoa87yR2wjWcMcIAitD/VJOe11sR3bOVJ/tiULSiwhmF9KBXlFvFDDWMWAaW4UZ5FPqJFIpTHrkGrLFuk0w0= generated-by-azure"
          + username   = "azureadmin"
        }

      + boot_diagnostics {
          + storage_account_uri = (known after apply)
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = "myOsDisk"
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts-gen2"
          + version   = "latest"
        }
    }

  # azurerm_network_interface.my_terraform_nic will be created
  + resource "azurerm_network_interface" "my_terraform_nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "northeurope"
      + mac_address                   = (known after apply)
      + name                          = "myNIC"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg_vm_linux"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "my_nic_configuration"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_interface_security_group_association.example will be created
  + resource "azurerm_network_interface_security_group_association" "example" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # azurerm_network_security_group.my_terraform_nsg will be created
  + resource "azurerm_network_security_group" "my_terraform_nsg" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "upNetworkSecurityDemo"
      + resource_group_name = "rg_vm_linux"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "SSH"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "HTTPS"
              + priority                                   = 1003
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "HTTP"
              + priority                                   = 1002
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # azurerm_public_ip.my_terraform_public_ip will be created
  + resource "azurerm_public_ip" "my_terraform_public_ip" {
      + allocation_method       = "Dynamic"
      + availability_zone       = (known after apply)
      + domain_name_label       = "bhs-task-web"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "northeurope"
      + name                    = "myPublicIP"
      + resource_group_name     = "rg_vm_linux"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + zones                   = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "rg_vm_linux"
    }

  # azurerm_storage_account.my_storage_account will be created
  + resource "azurerm_storage_account" "my_storage_account" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_blob_public_access          = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "northeurope"
      + min_tls_version                   = "TLS1_0"
      + name                              = "diag316926a224d09c1d"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "rg_vm_linux"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
    }

  # azurerm_subnet.my_terraform_subnet will be created
  + resource "azurerm_subnet" "my_terraform_subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "mySubnet"
      + resource_group_name                            = "rg_vm_linux"
      + virtual_network_name                           = "myVnet"
    }

  # azurerm_virtual_network.my_terraform_network will be created
  + resource "azurerm_virtual_network" "my_terraform_network" {
      + address_space         = [
          + "10.0.0.0/16",
        ]
      + dns_servers           = (known after apply)
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "northeurope"
      + name                  = "myVnet"
      + resource_group_name   = "rg_vm_linux"
      + subnet                = (known after apply)
      + vm_protection_enabled = false
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ domain_name_label   = "bhs-task-up.northeurope.cloudapp.azure.com" -> (known after apply)
  ~ public_ip_address   = "52.138.194.104" -> (known after apply)
```
</details>